export type TemplateItem = {
  id: string;
  title: string;
  text: string;
};

export const listTemplates: {
  id: string;
  title: string;
  items: TemplateItem[];
}[] = [
  {
    id: "list-1",
    title: "List 1. Transfer In/Out",
    items: [
      {
        id: "transfer",
        title: "Transfer In and Out",
        text: `11142_สาขาเพชรเกษม 1
Open & Close service 09.00-22.00
First & Last Shift 06.00-22.30

ขอแจ้งวันที่ วัน/เดือน/ปี
สินค้าโอน
11142_เพชรเกษม1(ต้นทาง)
ไปยังสาขา
XXXX_สาขา......(ปลายทาง)

จำนวนรายการสินค้า XX รายการ

1. Name list Barcode xxx จำนวน xx
2. Name list Barcode xxx จำนวน xx
3. Name list Barcode xxx จำนวน xx


พขร. คุณชิษณุพงษ์ ประสพคำ
ทะเบียนรถขนส่ง
2 ฒต 7968 กรุงเทพ

พนักงานร่วมตรวจสอบสินค้า ดังนี้

1.Name.....
2.Name.....
3.Name.....

ตรวจสอบเรียบร้อย/ตรวจรับเรียบร้อย

ผู้รายงาน
Name...... (LP)
Tel.......`,
      },
    ],
  },
  {
    id: "list-2",
    title: "List 2. Dc on Store",
    items: [
      {
        id: "ff-simple",
        title: "2.1 FF",
        text: `DC FF วัน/เดือน/ปี
เข้าสาขา= XX PL
ผ้าคลุมอุณหภูมิ = XX ผืน
Thermo= XX ตู้
คืนตะกร้า = XX PL
คืนพาเลทไม้= XX PL`,
      },

      {
        id: "df-simple",
        title: "2.2 DF",
        text: `วัน/เดือน/ปี
Dc DF คันที่ 1(BPDC) เข้าสาขา =XX PL
โท๊ดเทา= XX
โท๊ดแดง= XX

สินค้าFocus
LIQUOR, นมผง, ไฟฟ้าใหญ่,ไฟฟ้าเล็ก, แบรนด์

** สินค้าเข้าครบ เช็คสินค้าที่ Focus`,
      },
   {
        id: "chicken",
        title: "2.3 รับไก่ส่งตรง",
        text: `วันที่ วัน/เดือน/ปี

รับชิ้นส่วนไก่ บริษัทแหลมทอง  XX รายการ

เข้าแผนก  Butchery 


รายการถุงละ 4 กก.

สุ่มชั่งน้ำในถุง

-ปีกบนไก่ xx น้ำขีด

-นส. xx น้ำขีด

-อกไก่ xx น้ำขีด


- ** ทำCN คืน xx  รายการ (ถ้ามีให้ใส่รายละเอียด)`,
      },


    ],
  },
  {
    id: "list-3",
    title: "List 3. Daily Report",
    items: [
      {
        id: "meeting",
        title: "3.1 Meeting",
        text: `11142_เพชรเกษม1
Open & Close service 09:00-22:00
First & Last Shift 06:00-22.30

รายงาน Morning Brief
ประจำวันที่   วัน/เดือน/ปี

บริเวณประชุม :: จุดบริการล็อคนมผง

เวลาประชุม : (Time Xx.XX ใส่เวลา)

กล้องวงจรปิดบริเวณ : : จุดบริการล็อคนมผง

กล้องวงจรปิด : Online

ผู้รายงาน
Name ...... (LP)
Tel........`,
      },
      {
        id: "outside-store",
        title: "3.2 สินค้านอก store *Report only Monday",
        text: `11142_เพชรเกษม1
Open & Close service 09:00-22:00
First & Last Shift 06:00-22:30

โจทย์ : สาขามีสินค้าด้านนอกสโตร์ หรือ ไม่
ตอบ :ไม่มี

โจทย์ : ขออนุมัติ VP. Opt. หรือ ไม่
ตอบ :ไม่มี

โจทย์ : สาขาจัดทำเอกสาร Stock Card หรือ ไม่
ตอบ : สาขาไม่มีสินค้าด้านนอกสโตร์

โจทย์ : มีสินค้าแอลกอฮอลล์ จัดเก็บนอกอาคาร หรือ ไม่
ตอบ :ไม่มี

ชื่อผู้จัดการสาขา
คุณเพชรนภา ทองทับทิม
Tel.081-1705394

ผู้รายงาน

Name ...... (LP)
Tel. ......`,
      },
      {
        id: "boxes",
        title: "3.3 กล่อง",
        text: `11142_เพชรเกษม1
Open & Close service 09:00-22:00
First & Last Shift 06:00-22:30

รายงาน การขายกระดาษลัง (เหมารายเดือน)

เมื่อวันที่ วัน/เดือน/ปี
ได้ขายกระดาษลังแบบเหมารายเดือน
ให้กับ บริษัท สยามคราฟท์อุตสาหกรรม จำกัด (เครือ SCG) ที่เป็นผู้ชนะการประมูล ในราคา กิโลกรัมละ 4.03 บาท  ทางผู้รับเหมาได้ทำการเก็บกระดาษลังเรียบร้อยแล้ว
เลขที่ซีล Ex.U194509
ล็อคซีลที่รถเรียบร้อย

ผู้รายงาน
Name ...... (LP)
Tel........`,
      },
      {
        id: "boonterm",
        title: "3.4 ตู้บุญเติม",
        text: `11142_สาขาเพชรเกษม1
Open & Close service 09:00-22:00
First & Last Shift 06:00-22.30

รายงานการเปิดตู้บุญเติมประจำสัปดาห์จำนวน 2 ตู้ วันที่ วัน/เดือน/ปี
ตู้ที่ 1 ทางเข้า-ออกพนักงาน
จำนวนเงิน 999 บาท
ผลต่าง 0 บาท
CCTV: มีกล้อง CCTV
จากใบเสร็จเลขที่ :Ex.117005107

ตู้ที่ 2 บริเวณหน้าห้องน้ำลูกค้าชั้น1
จำนวนเงิน 999 บาท
ผลต่าง 0 บาท
CCTV : ไม่มีกล้อง CCTV
จากใบเสร็จเลขที่ : Ex.1117005108

นำเงินเข้าเครื่องเรียบร้อย


ผู้รายงาน
Name ...... (LP)
Tel ........`,
      },
      {
        id: "close-shift",
        title: "3.5 ปิดงาน กะบ่าย",
        text: `สาขา 11142_เพชรเกษม1

Open & Close service 09:00-22:00
First & Last Shift 06:00-22:30

รายงานเปิด/ปิดประตู Auto Door และ ประตูต่างๆ ประจำวันที่ วัน/เดือน/ปี

ประตูทางเข้าออกพนักงาน :021069

_______________

ประตูออโต้ 1 (ศูนย์อาหาร) :021102

ประตูออโต้ 2 (Kfc) : 021103

ประตูออโต้ 3 (โบว์แดง) : 021106

ประตูออโต้ 4 (อเมซอล) : 021107

_______________

ประตูรับส่งสินค้า1 :000026

ประตูรับส่งสินค้า2 :021198

ประตูรับส่งสินค้า3 :021099

ประตูรับส่งเอกสาร GR :021100

ประตูห้องกล่องนอก :021087

________________

ประตูหนีไฟ 1 :ไม่ล็อกซีล

________________

ประตูKFC(ใหญ่) :021104

ประตูKFC(เล็ก) :021105

ประตูรถเข็น :021104

ห้องMDB :021108

หมายเหตุ -



ผู้ร่วมตรวจสอบ

Duty :Name....

MTN : Name....

LP: Name...



ผู้รายงาน

Name......(LP)

Tel......`,
      },
    ],
  },
  {
    id: "list-4",
    title: "List 4. List Name Store",
    items: [
      {
        id: "names",
        title: "List Name Store",
        text: `Store 11142 PM1

(หัวหน้าแผนก)

คุณ ณัฐพล สาเพิ่มทรัพย์ (C2)
คุณ นฤมล อินทสันต์ (C2)
คุณ ประศักดิ์ โถนสูงเนิน (C2)
คุณ เกียรติชัย จินตรักษ์ (C2)
คุณ ชนกานต์ โนวาส (C3)
คุณ ประภากรณ์ เกษม (C3)
คุณ เอกชัย ลายสาคร (C4)
คุณ รัฐวุฒิชัย นาคสุวรรณ (C4)
คุณ ทศพร สุวรรณกาศ (MFF)
คุณ อังคนา โพธิ์สุวรรณ (M-OPT)

(Gr)
คุณ จุฑามาศ สินธวรัตน์
คุณ วันเพ็ญ ก๊กเกี๊ยด
คุณ ปวีณา องอาจ

(MTN)
คุณ ธนากร ปภังเมืองกร
คุณ ปฐวี สถาอุ่น
คุณ ณัฐภูมิ ทองยศ
คุณ เดชา บัวอ่อง (C7)`,
      },
    ],
  },
];
